<?php


//陣列宣告方式

echo"<hr>";
// $a=[1,2,3,4];
// $a=["小明","小華","小強","阿國"];
// $a=[12=>"小明",23=>"小華",30=>"小強",42=>"阿國",];

// $a=["小明"=>12,"小華"=>23,"小強"=>30,"阿國"=>42,];

// print_r ($a);

//空陣列
// $a[]=12;
// $a[]=22;
// $a[]=333;
// $a[]=39;

// $a[22]="小明";
// $a[23]="小華";
// $a[30]="小強";
// $a[40]="小建";

$a["小明"]="22";
$a["小華"]="23";
$a["小強"]="24";

//陣列檢查方式
// echo "<pre>" ;print_r($a); "</pre>";
// echo $a["小明"];

//陣列的維度

// $a=[[1,2,3],[4,5,6],[7,8,9]];


$a=["小明"=>["國文"=>32,"英文"=>60,"歷史"=>99],
    "小華"=>["國文"=>32,"英文"=>60,"數學"=>85],
    "小強"=>["國文"=>32,"英文"=>60,"數學"=>85 ,"歷史"=>85 ,"化學"=>60 ,"公民"=>80],
    "阿國"=>42,];

$b="AAAA";

echo "<pre>" ;print_r($a); "</pre>";

//陣列韓式


echo "count(\$a)=>";
echo count($a); //只算第一層元素個數

echo"<hr>";

echo "is_array(\$a)=>";
echo is_array($a);
echo"<hr>";

echo "in_array(\$a)=>";
echo in_array(["國文"=>32,"英文"=>60,"數學"=>85],$a);
echo"<hr>";

echo "sore(\$a)";
sort($a);




?>